###################################################################

# Created by write_sdc on Wed Nov 30 23:27:59 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max WC0D72COM -max_library tcbn65gpluswc0d72\
                         -min BC0D88COM -min_library tcbn65gplusbc0d88
set_max_transition 0.1 [current_design]
set_max_fanout 6 [current_design]
set_driving_cell -lib_cell INVD1 [get_ports clk]
set_driving_cell -lib_cell INVD1 [get_ports down]
set_driving_cell -lib_cell INVD1 [get_ports rst_n]
set_load -pin_load 0.003772 [get_ports {count[7]}]
set_load -pin_load 0.003772 [get_ports {count[6]}]
set_load -pin_load 0.003772 [get_ports {count[5]}]
set_load -pin_load 0.003772 [get_ports {count[4]}]
set_load -pin_load 0.003772 [get_ports {count[3]}]
set_load -pin_load 0.003772 [get_ports {count[2]}]
set_load -pin_load 0.003772 [get_ports {count[1]}]
set_load -pin_load 0.003772 [get_ports {count[0]}]
create_clock [get_ports clk]  -period 100  -waveform {0 50}
set_clock_uncertainty 0.05  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -min -fall 0.1 [get_clocks clk]
set_false_path   -from [get_ports rst_n]
set_input_delay -clock clk  0.1  [get_ports rst_n]
set_input_delay -clock clk  0.1  [get_ports down]
set_output_delay -clock clk  0.1  [get_ports {count[7]}]
set_output_delay -clock clk  0.1  [get_ports {count[6]}]
set_output_delay -clock clk  0.1  [get_ports {count[5]}]
set_output_delay -clock clk  0.1  [get_ports {count[4]}]
set_output_delay -clock clk  0.1  [get_ports {count[3]}]
set_output_delay -clock clk  0.1  [get_ports {count[2]}]
set_output_delay -clock clk  0.1  [get_ports {count[1]}]
set_output_delay -clock clk  0.1  [get_ports {count[0]}]
set_load -max 0.00170874  [get_nets down]
set_load -min 0.00150804  [get_nets down]
set_resistance -max 0.0129924  [get_nets down]
set_resistance -min 0.0146953  [get_nets down]
set_load -max 0.00281879  [get_nets rst_n]
set_load -min 0.00248455  [get_nets rst_n]
set_resistance -max 0.02143  [get_nets rst_n]
set_resistance -min 0.0242465  [get_nets rst_n]
set_load -max 0.000345302  [get_nets {count[7]}]
set_load -min 0.000306457  [get_nets {count[7]}]
set_resistance -max 0.00303054  [get_nets {count[7]}]
set_resistance -min 0.00342294  [get_nets {count[7]}]
set_load -max 0.000773049  [get_nets {count[6]}]
set_load -min 0.00068051  [get_nets {count[6]}]
set_resistance -max 0.00677898  [get_nets {count[6]}]
set_resistance -min 0.00767236  [get_nets {count[6]}]
set_load -max 0.00170929  [get_nets {count[5]}]
set_load -min 0.00150897  [get_nets {count[5]}]
set_resistance -max 0.0149934  [get_nets {count[5]}]
set_resistance -min 0.0169572  [get_nets {count[5]}]
set_load -max 0.00125677  [get_nets {count[4]}]
set_load -min 0.00111232  [get_nets {count[4]}]
set_resistance -max 0.0110269  [get_nets {count[4]}]
set_resistance -min 0.0124633  [get_nets {count[4]}]
set_load -max 0.000420653  [get_nets {count[3]}]
set_load -min 0.000371699  [get_nets {count[3]}]
set_resistance -max 0.0036902  [get_nets {count[3]}]
set_resistance -min 0.00417259  [get_nets {count[3]}]
set_load -max 0.00065947  [get_nets {count[2]}]
set_load -min 0.000578649  [get_nets {count[2]}]
set_resistance -max 0.00578106  [get_nets {count[2]}]
set_resistance -min 0.00654821  [get_nets {count[2]}]
set_load -max 0.00159079  [get_nets {count[1]}]
set_load -min 0.00140139  [get_nets {count[1]}]
set_resistance -max 0.0139509  [get_nets {count[1]}]
set_resistance -min 0.0157866  [get_nets {count[1]}]
set_load -max 0.00106167  [get_nets {count[0]}]
set_load -min 0.000937929  [get_nets {count[0]}]
set_resistance -max 0.00860116  [get_nets {count[0]}]
set_resistance -min 0.00972599  [get_nets {count[0]}]
set_load -max 0.000348107  [get_nets N21]
set_load -min 0.000308899  [get_nets N21]
set_resistance -max 0.00305511  [get_nets N21]
set_resistance -min 0.00345082  [get_nets N21]
set_load -max 0.000761663  [get_nets N22]
set_load -min 0.000675258  [get_nets N22]
set_resistance -max 0.006684  [get_nets N22]
set_resistance -min 0.00755147  [get_nets N22]
set_load -max 0.000876494  [get_nets N23]
set_load -min 0.000767912  [get_nets N23]
set_resistance -max 0.00768236  [get_nets N23]
set_resistance -min 0.00870508  [get_nets N23]
set_load -max 0.000597502  [get_nets N24]
set_load -min 0.000522784  [get_nets N24]
set_resistance -max 0.00523632  [get_nets N24]
set_resistance -min 0.00593537  [get_nets N24]
set_load -max 0.00122574  [get_nets N25]
set_load -min 0.00108495  [get_nets N25]
set_resistance -max 0.0107548  [get_nets N25]
set_resistance -min 0.0121555  [get_nets N25]
set_load -max 0.000955132  [get_nets N26]
set_load -min 0.000850039  [get_nets N26]
set_resistance -max 0.00838513  [get_nets N26]
set_resistance -min 0.00946422  [get_nets N26]
set_load -max 0.000550463  [get_nets N27]
set_load -min 0.000485833  [get_nets N27]
set_resistance -max 0.00482838  [get_nets N27]
set_resistance -min 0.00546115  [get_nets N27]
set_load -max 0.000754587  [get_nets N28]
set_load -min 0.000667127  [get_nets N28]
set_resistance -max 0.00662001  [get_nets N28]
set_resistance -min 0.00748439  [get_nets N28]
set_load -max 0.000817078  [get_nets n2]
set_load -min 0.000717267  [get_nets n2]
set_resistance -max 0.00716302  [get_nets n2]
set_resistance -min 0.00811264  [get_nets n2]
set_load -max 0.000813611  [get_nets n3]
set_load -min 0.000711889  [get_nets n3]
set_resistance -max 0.00713024  [get_nets n3]
set_resistance -min 0.00808208  [get_nets n3]
set_load -max 0.000545445  [get_nets n4]
set_load -min 0.000482022  [get_nets n4]
set_resistance -max 0.00478499  [get_nets n4]
set_resistance -min 0.00541034  [get_nets n4]
set_load -max 0.000453427  [get_nets n5]
set_load -min 0.000396332  [get_nets n5]
set_resistance -max 0.00397329  [get_nets n5]
set_resistance -min 0.00450484  [get_nets n5]
set_load -max 0.00133516  [get_nets n6]
set_load -min 0.00117961  [get_nets n6]
set_resistance -max 0.0117126  [get_nets n6]
set_resistance -min 0.0132441  [get_nets n6]
set_load -max 0.000466609  [get_nets n7]
set_load -min 0.0004146  [get_nets n7]
set_resistance -max 0.00409569  [get_nets n7]
set_resistance -min 0.00462464  [get_nets n7]
set_load -max 0.000495137  [get_nets n8]
set_load -min 0.000434008  [get_nets n8]
set_resistance -max 0.00434003  [get_nets n8]
set_resistance -min 0.00491721  [get_nets n8]
set_load -max 0.00149636  [get_nets n11]
set_load -min 0.00131324  [get_nets n11]
set_resistance -max 0.0113711  [get_nets n11]
set_resistance -min 0.0128794  [get_nets n11]
set_load -max 0.00197317  [get_nets n12]
set_load -min 0.00174697  [get_nets n12]
set_resistance -max 0.0141842  [get_nets n12]
set_resistance -min 0.0160304  [get_nets n12]
